ЧартерEDT.Расширение1/src/Catalogs/чартер_МаршрутыПерелета/чартер_МаршрутыПерелета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_МаршрутыПерелета</name>
  <attributes>
    <name>АэропортВылетаРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АэропортПрибытияРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/Catalogs/чартер_МаршрутыПерелета/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АэропортВылетаРейсаПриИзменении(Элемент)
	
	СформироватьПредставлениеМаршрута();
	
КонецПроцедуры

&НаКлиенте
Процедура АэропортПрибытияРейсаПриИзменении(Элемент)
	
	СформироватьПредставлениеМаршрута();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьПредставлениеМаршрута()
	
	Объект.ПредставлениеМаршрута = "";
	Объект.ПредставлениеМаршрута = "";
	
	Объект.ПредставлениеМаршрута = Объект.АэропортВылетаРейса	+ " - " + Объект.АэропортПрибытияРейса;
	Объект.Наименование = Объект.ПредставлениеМаршрута;
		
КонецПроцедуры

#КонецОбласти
